
<details>
<summary>Show Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_r2_bucket.media will be created
  + resource "cloudflare_r2_bucket" "media" {
      + account_id    = (sensitive value)
      + creation_date = (known after apply)
      + id            = (known after apply)
      + jurisdiction  = "default"
      + location      = (known after apply)
      + name          = "media"
      + storage_class = "Standard"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
